docs/node.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-22 Wed 16:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ZIO Node</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">ZIO Node</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc277617">1. Using <code>zio::Node</code></a></li>
</ul>
</div>
</div>
<div class="nav">
<ul class="org-ul">
<li><a href="index.html">Main Page</a></li>
<li><a href="install.html">Installation</a></li>
<li><a href="tutorial.html">Tutorial</a></li>
<li><a href="howtos.html">How-to guides</a></li>
<li><a href="whytos.html">Design documents</a></li>
<li><a href="api.html">API Reference</a></li>
</ul>

</div>

<p>
A <code>zio::Node</code> represents one vertex a graph or network which is
connected to other ZIO applications (which themselves may utilize
<code>zio::Node</code>) by the ZIO messages they exchange.  In general, this ZIO
graph is directed (possibly bidirectional) and possibly cyclic.  When
<code>zio::Node</code> is used, the network may be considered a specialized <b>ported
graph</b>.  That is, a ZIO node has a set of "ports" each of which are
identified by a name unique to the node and each have a ZeroMQ socket
through which messages are passed.
</p>

<p>
A <code>zio::Node</code> as a <code>zio::Peer</code> (see <a href=":peer.html">peer</a>) and uses it to advertise headers
holding the addresses of any ports (<code>zio::Port</code>, see <a href=":port.html">port</a>) which have
been asked to <code>bind()</code>.  This allows other ZIO nodes (or in general
other ZIO peers) to know an address to use to <code>connect()</code>.  It thus
allows edges to be formed in the graph based on specifying
application-dependent <b>abstract addressing</b> which is not tied to
specific transport or hardware.
</p>

<p>
For example, some data source may be partitioned and access may be
distributed across a set of nodes (eg, as in some DAQ layer or across
various points of the Wire-Cell execution graph).  These nodes may
each <code>bind()</code> and advertise the relevant address associated with a
nickname or headers following some convention.  Another set of nodes
knowing this convention may be configured <code>connect()</code> to addresses found
by some match on the advertised information.  This allows the graph to
<b>self-organize</b> without the human specifying detailed absolute
addressing.  It also allows the graph to <b>self-heal</b> as nodes die and
are reborn on different physical addresses but retain their nickname
and headers.
</p>

<div id="outline-container-orgc277617" class="outline-2">
<h2 id="orgc277617"><span class="section-number-2">1</span> Using <code>zio::Node</code></h2>
<div class="outline-text-2" id="text-1">
<p>
A node carries the <b>nickname</b> and <b>origin</b> value.  The nickname is
advertised by the node's peer and the origin is provided by all
messages produced by the node's ports.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold; text-decoration: underline;">zio</span>::<span style="font-weight: bold; text-decoration: underline;">Node</span> <span style="font-weight: bold; font-style: italic;">node</span>(<span style="font-style: italic;">"mynode"</span>, 42);
</pre>
</div>

<p>
A ZIO application using a node will populate its ports as needed
specifying their name and ZeroMQ port type.  This information will be
automatically provided by peer discovery.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold;">auto</span> <span style="font-weight: bold; font-style: italic;">input</span> = node.port(<span style="font-style: italic;">"input"</span>, ZMQ_SUB);
<span style="font-weight: bold;">auto</span> <span style="font-weight: bold; font-style: italic;">output</span> = node.port(<span style="font-style: italic;">"output"</span>, ZMQ_PUB);
</pre>
</div>

<p>
After population, ports can be accessed by name.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="font-weight: bold;">auto</span> <span style="font-weight: bold; font-style: italic;">ip</span> = node.port(<span style="font-style: italic;">"input"</span>);
<span style="font-weight: bold;">auto</span> <span style="font-weight: bold; font-style: italic;">op</span> = node.port(<span style="font-style: italic;">"output"</span>);
</pre>
</div>

<p>
See <a href="port.html">port</a> for details on using ports.  Once port operations are
complete the node may go online.  
</p>

<div class="org-src-container">
<pre class="src src-c++">node.online();
</pre>
</div>

<p>
This triggers any port binding, peer advertising of node nickname,
related port address headers, and any extra headers provided to the
node by the application and finally any port connections including
indirect ones that rely on peer discovery.
</p>

<p>
Later a node may be explicitly taken offline:
</p>

<div class="org-src-container">
<pre class="src src-c++">node.offline();
</pre>
</div>

<p>
This will disconnect and unbind ports and destroy the node's peer
object removing it from the ZIO discovery network.  The node itself
retains all ports and the above state changes transition can be
repeated:
</p>

<div class="org-src-container">
<pre class="src src-c++">node.online();
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
